app/views/schedules/_form.html.erb

      <%= form.label :trainer, class: "label is-medium"%>
      <%= form.collection_select(:trainer_id, Trainer.all, :id, :first_name)%>
---
SELECT "trainers".* FROM "trainers"

      <%= form.label :course_id, class: "label is-medium" %>
      <%= form.collection_select(:course_id, Course.all, :id, :course_name) %>
---
SELECT "courses".* FROM "courses"