app/controllers/comments_controller.rb

	def create
	    @trainer = Trainer.find(params[:trainer_id])
	    @comment = @trainer.comments.create(comment_params.merge(user_id: current_user.id))
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "trainer_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hnaah"], ["trainer_id", 1], ["user_id", 1], ["created_at", "2019-04-01 21:35:46.795640"], ["updated_at", "2019-04-01 21:35:46.795640"]]