app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("course_name", "location", "created_at", "updated_at", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?)  [["course_name", ""], ["location", "dublin"], ["created_at", "2019-04-07 13:46:51.588921"], ["updated_at", "2019-04-07 13:46:51.588921"], ["latitude", 51.502832], ["longitude", -0.119164]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["latitude", 53.069525], ["longitude", -6.091037], ["updated_at", "2019-04-02 23:51:29.127715"], ["id", 2]]