app/controllers/pages_controller.rb

  def search
  	if params[:search].blank?
    	redirect_to(root_path, notice: "Empty Search field! Please try again") and return
  	else
  		@parameter = params[:search].downcase
    	@results = Course.all.where("course_name LIKE :search", search: "%#{@parameter}%" )
    	@answers = Trainer.all.where("first_name LIKE :search", search: "%#{@parameter}%" )
---
SELECT "courses".* FROM "courses" WHERE (course_name LIKE 'step')
SELECT  "courses".* FROM "courses" WHERE (course_name LIKE 'stepaside golf course') LIMIT ?  [["LIMIT", 11]]
SELECT "trainers".* FROM "trainers" WHERE (first_name LIKE '%ber%')