app/controllers/trainers_controller.rb

  def index
    @trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"

  def create
    @trainer = Trainer.new(trainer_params)

    respond_to do |format|
      if @trainer.save
---
INSERT INTO "trainers" ("photo", "first_name", "last_name", "phone", "bio", "experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @trainer.update(trainer_params)
---
UPDATE "trainers" SET "experience" = ?, "updated_at" = ? WHERE "trainers"."id" = ?  [["experience", "8 years"], ["updated_at", "2019-04-07 14:19:54.354817"], ["id", 5]]

  def destroy
    @trainer.destroy
---
DELETE FROM "trainers" WHERE "trainers"."id" = ?  [["id", 2]]

    def set_trainer
      @trainer = Trainer.find(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]