app/views/trainers/show.html.erb


<h2> <%= @trainer.comments.count %> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."trainer_id" = ?  [["trainer_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."trainer_id" = ?  [["trainer_id", 1]]